<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/CIImage_CVMat.h</key>
		<data>
		4IGfsdCvM+HZREB374C04GJQ1Zw=
		</data>
		<key>Headers/OpenCVWrapper.h</key>
		<data>
		Wt+SSUrThyXme+Y06dKYzrTLeW8=
		</data>
		<key>Headers/SameFace-Swift.h</key>
		<data>
		gfATA2QY2QkEqD34vLAfDbx3Fsk=
		</data>
		<key>Headers/SameFace.h</key>
		<data>
		iUyl11tDg53V0vq69+jOyNFTVKQ=
		</data>
		<key>Headers/UIImage_CVMat.h</key>
		<data>
		cymGX3vdXBNBjvWWiwX9KjhVqqI=
		</data>
		<key>Headers/face.hpp</key>
		<data>
		XiEhEfBs5d6FEKf8qCiwGvqtUYw=
		</data>
		<key>Headers/general.hpp</key>
		<data>
		a8NURiCITHOege0qaNfThYMb8Y4=
		</data>
		<key>Info.plist</key>
		<data>
		dSNkXNctPoRhEn7szJcn+1H/YKs=
		</data>
		<key>Modules/SameFace.swiftmodule/x86_64.swiftdoc</key>
		<data>
		ghX+RJiyoHS0pC0yAuGwnwYA9/M=
		</data>
		<key>Modules/SameFace.swiftmodule/x86_64.swiftmodule</key>
		<data>
		4C0umHYWAC3nL1lNLJorF+p+BgQ=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		5zybl0UnXmZBnpfQuJtK7y9ysNA=
		</data>
		<key>OpenFace.mlmodelc/coremldata.bin</key>
		<data>
		74OZd7YMWuo9JRyRFGmp5oEchm0=
		</data>
		<key>OpenFace.mlmodelc/model.espresso.net</key>
		<data>
		AM6Kq+iI3qr/+QE05I90IF4LUgA=
		</data>
		<key>OpenFace.mlmodelc/model.espresso.shape</key>
		<data>
		ThJhI3TyojlNmnApAOjn+5jyoW0=
		</data>
		<key>OpenFace.mlmodelc/model.espresso.weights</key>
		<data>
		P1SVMykvjrbp0BuElFoBzUJNd8M=
		</data>
		<key>OpenFace.mlmodelc/model/coremldata.bin</key>
		<data>
		5LR8oiKDLNxRPHoayQMZXfjuLus=
		</data>
		<key>haarcascade_frontalface_alt.xml</key>
		<data>
		EkapDR99LVIq6onpPtD6ijjZk6M=
		</data>
		<key>shape_predictor_68_face_landmarks.xml</key>
		<data>
		x7DgeApP2hgPdarfZUg4wYZu5fs=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/CIImage_CVMat.h</key>
		<dict>
			<key>hash</key>
			<data>
			4IGfsdCvM+HZREB374C04GJQ1Zw=
			</data>
			<key>hash2</key>
			<data>
			fMFH7g/o/lhzn3M1Vx6jexlqj5l1NMKsqmmgL6jtciM=
			</data>
		</dict>
		<key>Headers/OpenCVWrapper.h</key>
		<dict>
			<key>hash</key>
			<data>
			Wt+SSUrThyXme+Y06dKYzrTLeW8=
			</data>
			<key>hash2</key>
			<data>
			R1qn3SQSndJs0XoBy2Z+394ILyPCKMZaP/hFAWOgmFE=
			</data>
		</dict>
		<key>Headers/SameFace-Swift.h</key>
		<dict>
			<key>hash</key>
			<data>
			gfATA2QY2QkEqD34vLAfDbx3Fsk=
			</data>
			<key>hash2</key>
			<data>
			qCz+Qqgun38h7slKwbbHDtTDEbpudF6hTb0xjdjRyi0=
			</data>
		</dict>
		<key>Headers/SameFace.h</key>
		<dict>
			<key>hash</key>
			<data>
			iUyl11tDg53V0vq69+jOyNFTVKQ=
			</data>
			<key>hash2</key>
			<data>
			2BkJ83jIbyoICKWUzK8uj/Wy+JmKSldkr4SpeizfrkU=
			</data>
		</dict>
		<key>Headers/UIImage_CVMat.h</key>
		<dict>
			<key>hash</key>
			<data>
			cymGX3vdXBNBjvWWiwX9KjhVqqI=
			</data>
			<key>hash2</key>
			<data>
			MieyBtnDabakIooTFjVtbPT4ohSBHm3hOpuz8fkdd0Q=
			</data>
		</dict>
		<key>Headers/face.hpp</key>
		<dict>
			<key>hash</key>
			<data>
			XiEhEfBs5d6FEKf8qCiwGvqtUYw=
			</data>
			<key>hash2</key>
			<data>
			1SG9PkBDtxu10IzKKz3yDTtnThMtKdZtrfeeqSD05Ms=
			</data>
		</dict>
		<key>Headers/general.hpp</key>
		<dict>
			<key>hash</key>
			<data>
			a8NURiCITHOege0qaNfThYMb8Y4=
			</data>
			<key>hash2</key>
			<data>
			QL4wzAQQenVERPBin5TWpBytAEQYjNYW3H7E0PkEKOw=
			</data>
		</dict>
		<key>Modules/SameFace.swiftmodule/x86_64.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			ghX+RJiyoHS0pC0yAuGwnwYA9/M=
			</data>
			<key>hash2</key>
			<data>
			SpxTABLg7xTqi7nSsWHFnwYcsjXCeqrdlyh9DjJFYW4=
			</data>
		</dict>
		<key>Modules/SameFace.swiftmodule/x86_64.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			4C0umHYWAC3nL1lNLJorF+p+BgQ=
			</data>
			<key>hash2</key>
			<data>
			j55sJxMSmGm9LnKmkp0nbDua/F8sDSaar2VhzSXYtKE=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash</key>
			<data>
			5zybl0UnXmZBnpfQuJtK7y9ysNA=
			</data>
			<key>hash2</key>
			<data>
			OuNkuYYElPcPUAZDVIuvks7q8JDnSKRuHnQHBhpqEGA=
			</data>
		</dict>
		<key>OpenFace.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			74OZd7YMWuo9JRyRFGmp5oEchm0=
			</data>
			<key>hash2</key>
			<data>
			NwWkevRK0TOBr2v1UG3LMGhNpv/tzQSVjCldPbCA1CA=
			</data>
		</dict>
		<key>OpenFace.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			AM6Kq+iI3qr/+QE05I90IF4LUgA=
			</data>
			<key>hash2</key>
			<data>
			S8KU2xk75f3/5SXa/Irlhq/r+CuZQ6rQZ+roAJwW4Vs=
			</data>
		</dict>
		<key>OpenFace.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			ThJhI3TyojlNmnApAOjn+5jyoW0=
			</data>
			<key>hash2</key>
			<data>
			Oq1fJ/nj3lZcy3JeteDUVAM64QsE2K9v7dT+aLYjJpY=
			</data>
		</dict>
		<key>OpenFace.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			P1SVMykvjrbp0BuElFoBzUJNd8M=
			</data>
			<key>hash2</key>
			<data>
			t8vTu7SCl1dUM94QoYXKek1Yn4BPc/ywUocy142nONk=
			</data>
		</dict>
		<key>OpenFace.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			5LR8oiKDLNxRPHoayQMZXfjuLus=
			</data>
			<key>hash2</key>
			<data>
			QN0pPj+e15nhf0jpLecEMajVDcXVsgHiMNdHmGmm9j4=
			</data>
		</dict>
		<key>haarcascade_frontalface_alt.xml</key>
		<dict>
			<key>hash</key>
			<data>
			EkapDR99LVIq6onpPtD6ijjZk6M=
			</data>
			<key>hash2</key>
			<data>
			YoHfE0Wcwhj/BH0Csq44WbEv8UqT/+iVL3sz+te5aXs=
			</data>
		</dict>
		<key>shape_predictor_68_face_landmarks.xml</key>
		<dict>
			<key>hash</key>
			<data>
			x7DgeApP2hgPdarfZUg4wYZu5fs=
			</data>
			<key>hash2</key>
			<data>
			+9wsuA65qnp1hnLL/doyumMA7+m25seimf9+c2sRuS8=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
